app/Controllers/Api/FinanceController.php

    public function index()
    {
        $model = new TransactionModel();
        $data = $model->where('user_id', $this->request->user_id)
                      ->orderBy('date', 'DESC')
                      ->findAll();
---
SELECT *
FROM `transactions`
WHERE `user_id` = '1'
ORDER BY `date` DESC


            // 2. Update Saldo User (Otomatis)
            $userModel = new UserModel();
            $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

                $newBalance = $currentBalance - $amount;
            }

            $userModel->update($userId, ['balance' => $newBalance]);
---
UPDATE `users` SET `balance` = 2000000, `updated_at` = '2025-11-24 03:58:23'
WHERE `users`.`id` IN ('1')