app/Controllers/Api/TradeController.php

    public function portfolio()
    {
        $userId = $this->request->user_id;
        $model = new PortfolioModel();
        $portfolios = $model->where('user_id', $userId)->findAll();

        $userModel = new UserModel();
        $user = $userModel->find($userId);
---
SELECT *
FROM `portfolios`
WHERE `user_id` = '1'
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function buy()
    {
        $rules = [
            'symbol' => 'required',
            'quantity' => 'required|numeric'
        ];
        if (!$this->validate($rules)) return $this->error($this->validator->getErrors());

        $symbol = strtoupper($this->request->getVar('symbol'));
        $qty = (float)$this->request->getVar('quantity');
        $userId = $this->request->user_id;

        $marketService = new MarketService();
        $currentPrice = $marketService->getPrice($symbol);

        if (!$currentPrice) {
            return $this->error("Gagal mengambil harga pasar untuk simbol: $symbol.", 400);
        }

        $totalCost = $currentPrice * $qty;

        $userModel = new UserModel();
        $portfolioModel = new PortfolioModel();

        $db = \Config\Database::connect();
        $db->transStart();

        try {
            $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

            }

            // Kurangi Saldo
            $userModel->update($userId, ['balance' => (float)$user['balance'] - $totalCost]);

            // Update Portfolio (Average Down)
            $existing = $portfolioModel->where('user_id', $userId)->where('symbol', $symbol)->first();
---
UPDATE `users` SET `balance` = 1811500, `updated_at` = '2025-11-24 04:01:01'
WHERE `users`.`id` IN ('1')
SELECT *
FROM `portfolios`
WHERE `user_id` = '1'
AND `symbol` = 'BBCA.JK'
 LIMIT 1

                    'average_price' => $newAvgPrice
                ]);
            } else {
                $portfolioModel->insert([
                    'user_id' => $userId,
                    'symbol' => $symbol,
                    'quantity' => $qty,
                    'average_price' => $currentPrice
                ]);
---
INSERT INTO `portfolios` (`user_id`, `symbol`, `quantity`, `average_price`, `created_at`, `updated_at`) VALUES ('1', 'BBCA.JK', 20, 8425, '2025-11-24 04:01:01', '2025-11-24 04:01:01')

    public function sell()
    {
        // 1. Validasi
        $rules = [
            'symbol' => 'required',
            'quantity' => 'required|numeric'
        ];
        if (!$this->validate($rules)) return $this->error($this->validator->getErrors());

        $symbol = strtoupper($this->request->getVar('symbol'));
        $qtyToSell = (float)$this->request->getVar('quantity');
        $userId = $this->request->user_id;

        // 2. Cek apakah User punya asetnya
        $portfolioModel = new PortfolioModel();
        $existing = $portfolioModel->where('user_id', $userId)->where('symbol', $symbol)->first();
---
SELECT *
FROM `portfolios`
WHERE `user_id` = '1'
AND `symbol` = 'BBCA.JK'
 LIMIT 1


        try {
            // A. Tambah Saldo User
            $user = $userModel->find($userId);
            $newBalance = (float)$user['balance'] + $totalRevenue;
            $userModel->update($userId, ['balance' => $newBalance]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
UPDATE `users` SET `balance` = 1996400, `updated_at` = '2025-12-05 09:29:04'
WHERE `users`.`id` IN ('1')


            if ($remainingQty <= 0) {
                // Jika habis, hapus baris dari tabel
                $portfolioModel->delete($existing['id']);
---
DELETE FROM `portfolios`
WHERE `id` IN ('1')