app/Controllers/AuthController.php

    public function register()
    {
        $rules = [
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'name' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->error($this->validator->getErrors());
        }

        $model = new UserModel();
        $data = [
            'email'    => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
            'name'     => $this->request->getVar('name'),
        ];

        $model->insert($data);
---
INSERT INTO `users` (`email`, `password`, `name`, `created_at`, `updated_at`) VALUES ('atester@gmail.com', '$2y$10$Z0FHo6xOkXjNTQmeWDFUwOo15VVVRpQOTAZmSD2vqCPWgyiF6Mgwi', 'TesteraSakukua', '2025-12-05 09:20:29', '2025-12-05 09:20:29')

    public function login()
    {
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->error($this->validator->getErrors());
        }

        $model = new UserModel();
        $user = $model->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'tester@gmail.com'
 LIMIT 1